performance/benchmark/tests/fixtures/wrk2-output.txt
Running 27s test @ http://127.0.0.1:39091
  2 threads and 32 connections
  Thread calibration: mean lat.: 1.223ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.191ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.96ms  427.52us   2.30ms   63.75%
    Req/Sec    52.96     91.48   333.00     77.91%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.95ms
 75.000%    1.22ms
 90.000%    1.56ms
 99.000%    1.94ms
 99.900%    2.19ms
 99.990%    2.30ms
 99.999%    2.30ms
100.000%    2.30ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.129     0.000000            1         1.00
       0.392     0.100000           80         1.11
       0.534     0.200000          160         1.25
       0.707     0.300000          241         1.43
       0.846     0.400000          321         1.67
       0.955     0.500000          400         2.00
       1.001     0.550000          441         2.22
       1.072     0.600000          480         2.50
       1.128     0.650000          522         2.86
       1.174     0.700000          561         3.33
       1.216     0.750000          600         4.00
       1.259     0.775000          620         4.44
       1.324     0.800000          640         5.00
       1.367     0.825000          660         5.71
       1.430     0.850000          680         6.67
       1.491     0.875000          701         8.00
       1.530     0.887500          710         8.89
       1.556     0.900000          720        10.00
       1.578     0.912500          730        11.43
       1.609     0.925000          740        13.33
       1.670     0.937500          750        16.00
       1.690     0.943750          755        17.78
       1.703     0.950000          760        20.00
       1.733     0.956250          765        22.86
       1.772     0.962500          770        26.67
       1.804     0.968750          775        32.00
       1.837     0.971875          778        35.56
       1.841     0.975000          780        40.00
       1.861     0.978125          783        45.71
       1.884     0.981250          785        53.33
       1.914     0.984375          788        64.00
       1.921     0.985938          789        71.11
       1.924     0.987500          790        80.00
       1.943     0.989062          792        91.43
       1.945     0.990625          793       106.67
       1.949     0.992188          794       128.00
       1.980     0.992969          795       142.22
       1.980     0.993750          795       160.00
       1.993     0.994531          796       182.86
       2.021     0.995313          797       213.33
       2.021     0.996094          797       256.00
       2.087     0.996484          798       284.44
       2.087     0.996875          798       320.00
       2.087     0.997266          798       365.71
       2.187     0.997656          799       426.67
       2.187     0.998047          799       512.00
       2.187     0.998242          799       568.89
       2.187     0.998437          799       640.00
       2.187     0.998633          799       731.43
       2.299     0.998828          800       853.33
       2.299     1.000000          800          inf
#[Mean    =        0.960, StdDeviation   =        0.428]
#[Max     =        2.298, Total count    =          800]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  184.00us
 75.000%  224.00us
 90.000%  281.00us
 99.000%  532.00us
 99.900%    0.94ms
 99.990%    0.95ms
 99.999%    0.95ms
100.000%    0.95ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.082     0.000000            1         1.00
       0.134     0.100000           80         1.11
       0.151     0.200000          166         1.25
       0.163     0.300000          248         1.43
       0.174     0.400000          325         1.67
       0.184     0.500000          402         2.00
       0.190     0.550000          442         2.22
       0.196     0.600000          482         2.50
       0.205     0.650000          520         2.86
       0.214     0.700000          561         3.33
       0.224     0.750000          604         4.00
       0.230     0.775000          624         4.44
       0.234     0.800000          640         5.00
       0.246     0.825000          662         5.71
       0.253     0.850000          680         6.67
       0.265     0.875000          700         8.00
       0.274     0.887500          713         8.89
       0.281     0.900000          723        10.00
       0.287     0.912500          730        11.43
       0.294     0.925000          742        13.33
       0.315     0.937500          750        16.00
       0.323     0.943750          756        17.78
       0.330     0.950000          760        20.00
       0.349     0.956250          765        22.86
       0.361     0.962500          770        26.67
       0.389     0.968750          775        32.00
       0.402     0.971875          778        35.56
       0.420     0.975000          780        40.00
       0.449     0.978125          783        45.71
       0.457     0.981250          785        53.33
       0.508     0.984375          788        64.00
       0.513     0.985938          789        71.11
       0.514     0.987500          790        80.00
       0.532     0.989062          792        91.43
       0.555     0.990625          793       106.67
       0.563     0.992188          794       128.00
       0.571     0.992969          795       142.22
       0.571     0.993750          795       160.00
       0.579     0.994531          796       182.86
       0.589     0.995313          797       213.33
       0.589     0.996094          797       256.00
       0.591     0.996484          798       284.44
       0.591     0.996875          798       320.00
       0.591     0.997266          798       365.71
       0.937     0.997656          799       426.67
       0.937     0.998047          799       512.00
       0.937     0.998242          799       568.89
       0.937     0.998437          799       640.00
       0.937     0.998633          799       731.43
       0.946     0.998828          800       853.33
       0.946     1.000000          800          inf
#[Mean    =        0.202, StdDeviation   =        0.082]
#[Max     =        0.946, Total count    =          800]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1824 requests in 18.08s, 493.41KB read
Requests/sec:    100.87
Transfer/sec:     27.29KB
MOSAIC_WINDOW thread=1 count=400 bins=0:12,1:4,3:8,4:8,6:4,7:12,10:16,13:16,16:12,17:4,19:8,20:8,22:4,23:12,26:16,29:16,32:12,33:4,35:8,36:8,38:4,39:12,42:16,45:16,48:12,49:4,51:8,52:8,54:4,55:12,58:16,61:16,64:12,65:4,67:8,68:8,70:4,71:12,74:16,77:16
MOSAIC_NON2XX thread=1 count=0
MOSAIC_WINDOW thread=2 count=400 bins=0:12,1:4,3:8,4:8,6:4,7:12,10:16,13:16,16:12,17:4,19:8,20:8,22:4,23:12,26:16,29:16,32:12,33:4,35:8,36:8,38:4,39:12,42:16,45:16,48:12,49:4,51:8,52:8,54:4,55:12,58:16,61:16,64:12,65:4,67:8,68:8,70:4,71:12,74:16,77:16
MOSAIC_NON2XX thread=2 count=0